In [170]:
import pandas

data = pandas.read_csv('titanic.csv', index_col='PassengerId')
total = data.shape[0]
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [171]:
sex_info = data['Sex'].value_counts()
print(sex_info['male'], sex_info['female'])

577 314

In [172]:
death_info = data['Survived'].value_counts(dropna = False)
print(death_info)
dead = death_info[0]
alive = death_info[1]
print(alive/(dead + alive)*100)

0    549
1    342
Name: Survived, dtype: int64
38.38383838383838

In [173]:
classes_info = data['Pclass'].value_counts(dropna = False)
print(classes_info)
first_class = classes_info[1] # 1 - 24, 2 - 21, 3 - 55 
print(100*first_class/total)

3    491
1    216
2    184
Name: Pclass, dtype: int64
24.242424242424242

In [174]:
age_info = data['Age'].value_counts(dropna = False)
average_age = data['Age'].mean()
median = data['Age'].median()
print(round(average_age,2), median)

29.7 28.0

In [175]:
sibsp = data['SibSp']
parch = data['Parch']
sibsp.corr(parch)
# 0.42

0.4148376986201567

In [193]:
C = data['Name']
# print(C)
def parse(A):
    d = []
    for index,name in enumerate(A):
        if 's.' in name:
            if "Miss." in name:
                d.append(name.partition("Miss. ")[2].split(' ')[0])
            elif '(' in name:
                d.append(name.split('(')[1].split(" ")[0])
#     print(d)
    return d

parr = pandas.Series(np.array(parse(C)))
parr.value_counts()

Anna         14
Mary         13
Elizabeth    11
Margaret     10
Alice         6
Helen         5
Maria         5
Bertha        5
Marie         4
Ellen         4
Augusta       4
Annie         4
Ada           4
Emily         4
Lillian       3
Hanora        3
Amelia        3
Edith         3
Katherine     3
Jane          3
Madeleine     3
Kate          3
Elisabeth     3
Ida           3
Florence      3
Catherine     3
Amy           2
Johanna       2
Constance     2
Ethel         2
             ..
Erna          1
Eugenie       1
Elina         1
Leah          1
Vera          1
Phyllis       1
Beila)        1
Roberta       1
Esther        1
Manca         1
Tillie        1
Elin          1
Virginia      1
Myna          1
Julie         1
Mantoura      1
Matilda       1
Alma          1
Selma         1
Anne          1
Selini        1
Simonne       1
Robina        1
Hanne         1
Eliza         1
(Marion       1
Lilian        1
Sigrid        1
Catharina     1
Juliette      1
Length: 177, dtype: int64

In [161]:
import re
import numpy as np
C = data['Name']

def parse2(A):
    d = []
    
    for index, name in enumerate(A):
        name1 = re.split("[, \(\)]+", name)
        d+= name1
    
    return d

parr = pandas.Series(np.array(parse2(C)))
parr.value_counts(dropna = False)

Mr.           517
Miss.         182
              144
Mrs.          125
William        62
John           44
Master.        40
Henry          34
James          24
Charles        23
George         22
Thomas         22
Edward         18
Mary           18
Anna           17
Joseph         16
Elizabeth      15
Frederick      15
Johan          15
Richard        14
Samuel         13
Arthur         13
Margaret       12
Alfred         12
Peter          11
Maria          11
Alexander      11
Jr             10
Robert         10
Leonard         9
             ...
Sobey           1
Joan            1
Jeremiah        1
Myna            1
Andreasson      1
Vere            1
Thorsten        1
Kiernan         1
Landergren      1
Sirota          1
Mamee           1
Hoffman"        1
Cohen           1
Gertrud         1
Montvila        1
Kingcome        1
Bessie          1
Kristine        1
Edmund          1
Simmons         1
Leontine        1
Bailey          1
Kent            1
Howard          1
Theodosia       1
Hileni          1
Celia           1
Aime            1
Kiamie          1
Peel            1
Length: 1553, dtype: int64

In [194]:
with open('6.txt', 'w') as f:
  f.write('Anna')